remixed123/IoT/CC3200/SendToEventHub/main.c
//*****************************************************************************
//
// Application Name        - SendToEventHub
// Application Version     - 1.1.0
// Application Modify Date - 14th of December 2014
// Application Developer   - Glenn Vassallo
// Application Repository  - https://github.com/remixed123/IoT
// Application Overview    - This is a sample application demonstrating the
//                           sending of telemetry (temperature data) from the
//                           CC3200 LaunchPad to Microsoft Azure Event Hub by
//                           utilising Event Hubs REST API over SSL/TLS. The
//                           application also retrieves the time from a SNTP
//                           server periodically, this helps to ensure that
//                           SSL connection will function.
// Application History     - The SendToEventHub example code has been created
//                           through modifying and including code from the SSL
//                           and Get_TIME examples that are provided with the
//                           CC3200 SDK - http://www.ti.com/tool/cc3200sdk
// Application Details     - https://github.com/remixed123/IoT/wiki
//
//*****************************************************************************

//*****************************************************************************
//
// Copyright (C) 2014 Texas Instruments Incorporated - http://www.ti.com/ 
// 
// 
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//    Redistributions of source code must retain the above copyright 
//    notice, this list of conditions and the following disclaimer.
//
//    Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the 
//    documentation and/or other materials provided with the   
//    distribution.
//
//    Neither the name of Texas Instruments Incorporated nor the names of
//    its contributors may be used to endorse or promote products derived
//    from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

//****************************************************************************
//
//! \addtogroup get_time
//! @{
//
//****************************************************************************

// Standard includes
#include <stdlib.h>
#include <string.h>
#include <stdio.h>

//CC3200 LaunchPad includes
#include "tmp006drv.h"

// simplelink includes
#include "simplelink.h"

// driverlib includes
#include "hw_types.h"
#include "hw_ints.h"
#include "hw_memmap.h"
#include "interrupt.h"
#include "prcm.h"
#include "pin.h"
#include "rom.h"
#include "rom_map.h"
#include "timer.h"
#include "utils.h"

//Free_rtos/ti-rtos includes
#include "osi.h"

// common interface includes
#include "network_if.h"
#ifndef NOTERM
#include "uart_if.h"
#endif
#include "gpio_if.h"
#include "i2c_if.h"
#include "timer_if.h"
#include "udma_if.h"
#include "pinmux.h"
#include "common.h"

//================================

//#define DATE                18    /* Current Date */
//#define MONTH               6     /* Month 1-12 */
//#define YEAR                2014  /* Current year */
//#define HOUR                12    /* Time - hours */
//#define MINUTE              32    /* Time - minutes */
//#define SECOND              0     /* Time - seconds */

//*****************************************************************************
//                       APPLICATION DETAIL DEFINES
//*****************************************************************************

#define APPLICATION_NAME        "SendToEventHub"
#define APPLICATION_VERSION     "1.1.0"

#define OSI_STACK_SIZE          4096

//*****************************************************************************
//                          EVENT HUB SERVER DEFINES
//*****************************************************************************

#define EH_SERVER_NAME		     "swiftsoftware-ns.servicebus.windows.net" // You will need change this to reflect your details
#define SSL_DST_PORT             443

//*****************************************************************************
//                        PACKET DELAY TIME DEFINES
//
// The application uses a simple delay to alter the time intervale between
// packets that are sent to Azure Event Hub. You can set the time by change the
// value below. This will provide an estimate, if you require a more accurate
// delay time, or you wish to do other things during the delay interval then
// you will need to setup a timer.
//
//*****************************************************************************
#define SLEEP_TIME            60 //This is in second, change this to set your delay time
#define SEC_TO_LOOP(x)        ((80000000/5)*x)

//*****************************************************************************
//                       CERTIFICATE LOCATION DEFINE
//
// You will need to include an SSL Certificate Authority file to be able to
// send SSL/TLS packets to Event Hub. Further details can be found at the
// wiki -
//
//*****************************************************************************

#define SL_SSL_CA_CERT_FILE_NAME        "/cert/azurecacert.der"

//*****************************************************************************
//                           SNTP CONFIGURATION DEFINES
//*****************************************************************************

#define TIME2013                3565987200u      /* 113 years + 28 days(leap) */
#define YEAR2013                2013
#define SEC_IN_MIN              60
#define SEC_IN_HOUR             3600
#define SEC_IN_DAY              86400

#define SERVER_RESPONSE_TIMEOUT 10
#define GMT_DIFF_TIME_HRS       10
#define GMT_DIFF_TIME_MINS      0

//*****************************************************************************
//                         HTTP POST HEADER DEFINES
//
// 1) You will need to update the POSTHEADER and HOSTHEADER here to reflect
//    your Azure setup.
// 2) You wil also need to change AUTHHEADER by generating a Shared Access
//    Signature that expires in say 10 years. You can do this from a C#
//    application, see the steps at this link -
// 3) Update the DATA portion to reflect the details you wish to send.
//
//*****************************************************************************
#define POSTHEADER "POST /swiftsoftware-eh/messages HTTP/1.1\r\n"
#define HOSTHEADER "Host: swiftsoftware-ns.servicebus.windows.net\r\n"
#define AUTHHEADER "Authorization: SharedAccessSignature sr=swiftsoftware-ns.servicebus.windows.net&sig=6sIkgCiaNbK9R0XEpsKJcQ2Clv8MUMVdQfEVQP09WkM%3d&se=1733661915&skn=EventHubPublisher\r\n"
#define CHEADER "Connection: Keep-Alive\r\n"
#define CTHEADER "Content-Type: application/json; charset=utf-8\r\n"
#define CLHEADER1 "Content-Length: "
#define CLHEADER2 "\r\n\r\n"
#define DATA1 "{\"MessageType\":\"CC3200 Sensor\",\"Temp\":"
#define DATA2 ",\"Humidity\":50,\"Location\":\"Glenn's Home\",\"Room\":\"Office\",\"Info\":\"Sent from CC3200 LaunchPad\"}"

//*****************************************************************************
//              Application specific status/error codes
//*****************************************************************************
//typedef enum{
//    // Choosing -0x7D0 to avoid overlap w/ host-driver's error codes
//    SERVER_GET_TIME_FAILED = -0x7D0,
//    DNS_LOOPUP_FAILED = SERVER_GET_TIME_FAILED  -1,
//
//    STATUS_CODE_MAX = -0xBB8
//}e_AppStatusCodes;

